Repository: hitman-rs/simple-mod-framework
Catalog: project.inlang/localisation.xcstrings
Source language: en
Languages: fr, zh_hans

# SkipIntro
source: Skip game intro video
fr: Passez l'introduction du jeu
zh_hans: 跳过游戏片头视频

# EnableDeveloperMode
source: Enable mod developer mode
fr: Activer le mode développeur
zh_hans: 启用模组开发者模式

# UseProxy
source: Use SMF mod update checking proxy
fr: Utiliser le mode proxy pour checker les mises à jour de mod
zh_hans: 使用 SMF 模组更新检查代理

# WelcomeToSMF
source: Welcome to the
fr: Bienvenu sur Simple Mod Framework
zh_hans: 欢迎来到

# EnableButton
source: Enable
fr: Activer
zh_hans: 启用

source: Experimental version
fr: Version Expérimentale
zh_hans: 实验性版本

# ExperimentalVersionDesc
source: You're currently running an experimental version of the framework
fr: Vous êtes actuellement sur une version expérimentale de SMF
zh_hans: 您当前正在运行一个实验性版本的框架

# CheckingForUpdates
source: Checking for framework updates...
fr: Vérification de mises à jour de SMF en cours...
zh_hans: 正在检查框架更新……

# MajorUpdateAvailable
source: Major framework update available
fr: Mise à jour majeure disponible pour SMF
zh_hans: 框架主要更新可用

# MinorUpdateAvailable
source: Framework update available
fr: Mise à jour disponible pour SMF
zh_hans: 框架更新可用

# PatchUpdateAvailable
source: Framework patch available
fr: Patch disponible pour SMF
zh_hans: 框架补丁可用

# UpdateFromTo
source: Update from version {from} to version {to}
fr: Mise à jour de la version {from} à la version {to}
zh_hans: 从 {from} 版本更新至 {to} 版本

# UpdateButton
source: Update
fr: Mettre à jour
zh_hans: 更新

# CouldntCheckFrameworkUpdates
source: Couldn't check for framework updates
fr: SMF n'a pas pu vérifier si une mise à jour est disponible
zh_hans: 无法检查框架更新

# SMFUpToDate
source: Framework up-to-date
fr: SMF est à jour
zh_hans: 框架已最新

# SMFUpToDateDesc
source: You're running the latest version of the framework (version {ver}).
fr: Vous êtes sur la dernière version de SMF (version {ver}).
zh_hans: 您正在运行最新版本框架（{ver} 版本）。

# CheckingModUpdate
source: Checking for updates to {mod}...
fr: Vérification de mise à jour disponible pour {mod}...
zh_hans: 正在检查 {mod} 更新……

# CouldntCheckModUpdate
source: Couldn't check for updates to {mod}
fr: SMF n'a pas pu vérifier si une mise à jour pour {mod} est disponible
zh_hans: 无法检查 {mod} 更新

# DevVersion
source: Development version
fr: Version de développement
zh_hans: 开发版本

# DevVersionDesc
source: You're using a development version of {mod} (version {ver}).
fr: Vous utilisez une version de développement du {mod} (version {ver}).
zh_hans: 您正在使用 {mod} 的开发版本（{ver} 版本）。

# MajorUpdateMod
source: Major update available for {mod}
fr: Mise à jour majeure disponible pour {mod}
zh_hans: {mod} 主要更新可用

# MinorUpdateMod
source: Update available for {mod}
fr: Mise à jour disponible pour {mod}
zh_hans: {mod} 更新可用

# PatchUpdateMod
source: Patch available for {mod}
fr: Patch disponible pour {mod}
zh_hans: {mod} 补丁可用

# RedownloadFromNexus
source: You can update this mod by re-downloading it from the Nexus.
fr: Vous pouvez mettre à jour ce mod en le retéléchargeant via Nexus.
zh_hans: 您可以通过从 Nexus 重新下载来更新此模组。

# GoToNexusButton
source: Go to Nexus
fr: Aller sur Nexus
zh_hans: 转到 Nexus

# ViewChangelogOnline
source: You can view the changelog for this update online.
fr: Vous pouvez voir le changelog de cette mise à jour sur internet.
zh_hans: 您可以在线查看本次更新日志。

source: Mods up-to-date
fr: Mods à jour
zh_hans: 模组已最新

# ModsUpToDateDesc
source: All your mods are fully updated!
fr: Tout vos mods sont à jour !
zh_hans: 您的所有模组已全部更新！

# DeveloperModeUpsellDesc
source: If you're a mod developer, you should enable developer mode, which gives you a few extra tools for developing mods.
fr: Si vous êtes un développeur de mod, vous devriez activer le mode développeur, vous aurez accès à des outils en plus pour le développement de mods.
zh_hans: 如果您是模组开发者，则您应该启用开发者模式，这将为您提供一些额外的工具来开发模组。

# DeveloperModeUpsell
source: Developer mode
fr: Mode développeur
zh_hans: 开发者模式

# AmModUser
source: I'm a mod user
fr: Je suis un utilisateur de mod
zh_hans: 我是模组使用者

# AmModDev
source: I'm a mod developer
fr: Je suis un développeur de mod
zh_hans: 我是模组开发者

# CouldntUpdateModDesc
source: The update to the mod is invalid!
fr: La mise à jour pour ce mod n'est pas valide !
zh_hans: 模组更新无效！

# SMFDownloadInProgress
source: The framework is being downloaded. Please wait.
fr: SMF est en train de se mettre à jour, veuillez patienter.
zh_hans: 正在下载框架，请稍候。

# SMFExtractionInProgress
source: The framework is being extracted. Please wait.
fr: SMF est en train de s'extraire pour se mettre à jour, veuillez patienter.
zh_hans: 正在提取框架，请稍候。

# ErrorUpdatingSMFDesc
source: There was an error updating the framework. Check your internet connection.
fr: Une erreur s'est produite lors de la mise à jour de SMF. Veuillez vérifier votre connexion internet.
zh_hans: 更新框架时出错。请检查您的网络连接。

# ModDownloadInProgress
source: The mod is being downloaded. Please wait.
fr: Le mod est en cours de téléchargement, veuillez patienter.
zh_hans: 正在下载模组，请稍候。

# ErrorUpdatingModDesc
source: There was an error updating the mod. Check your internet connection.
fr: Une erreur s'est produite lors de la mise à jour du mod. Veuillez vérifier votre connexion internet.
zh_hans: 更新模组时出错。请检查您的网络连接。

# ModExtractionInProgress
source: The mod is being extracted. Please wait.
fr: Le mod est en cours d'extraction, veuillez patienter.
zh_hans: 正在提取模组，请稍候。

# CantAutoUpdate
source: Can't automatically update this mod!
fr: Ce mod ne peut pas se mettre à jour automatiquement !
zh_hans: 无法自动更新此模组！

# CheckingModUpdates
source: Checking for mod updates
fr: Vérification des mises à jour de ce mod
zh_hans: 正在检查模组更新

# CheckingHashListUpdates
source: Checking for hash list updates
fr: Vérification des mises à jour de la liste de hash
zh_hans: 正在检查哈希列表更新

# CheckingHashListUpdatesDesc
source: Checking for updates to the hash lists...
fr: Recherche des mises à jour des listes de hash...
zh_hans: 正在检查哈希列表更新……

# HomePage
source: Home
fr: Menu principal
zh_hans: 主页

source: Mod Explorer
fr: Explorer vos mods
zh_hans: 模组浏览器

# SettingsPage
source: Settings
fr: Paramètres
zh_hans: 设置

# CreditsPage
source: Credits
fr: Crédits
zh_hans: 鸣谢

# CreditsText
source: The Simple Mod Framework directly uses the rpkg-rs library by Dafitius and the ResourceLib library by OrfeasZ for much of its functionality. The framework itself is licensed LGPLv3.
fr: Le Simple Mod Framework utilise directement la bibliothèque rpkg-rs par Dafitius et la bibliothèque ResourceLib par OrfeasZ pour la plupart de ses fonctionnalités. Le framework lui-même est sous licence LGPLv3.
zh_hans: Simple Mod Manager 直接使用 Dafitius 的 rpkg-rs 库和 OrfeasZ 的 ResourceLib 库进行其大部分功能。 框架本身采用 LGPLv3 许可。

# ApplyingMods
source: Applying your mods
fr: Appliquer vos mods
zh_hans: 正在应用您的模组

# ApplyingModsDesc
source: This might take a while, depending on your system and the mods you've enabled.
fr: Cela peut prendre un certain temps, selon votre système et les mods que vous avez activés.
zh_hans: 这可能需要一段时间，取决于您的系统和您启用的模组。

source: Deployment started
fr: Le déploiement a commencé
zh_hans: 部署已开始

# DeploymentStartedDesc
source: Your mods are being applied.
fr: Vos mods sont en cours d'application.
zh_hans: 您的模组正在应用中。

source: Couldn't start deployment
fr: Impossible de démarrer le déploiement
zh_hans: 无法启动部署

# CouldntStartDeploymentDesc
source: Your mods couldn't be applied.
fr: Vos mods n'ont pas pu être appliqués.
zh_hans: 无法应用您的模组。

source: Warning
fr: Avertissement
zh_hans: 警告

source: Error
fr: Erreur
zh_hans: 错误

source: Deployment successful
fr: Déploiement réussi
zh_hans: 部署成功

# DeploymentSuccessfulDesc
source: Your mods were applied successfully.
fr: Vos mods ont été appliqués avec succès.
zh_hans: 您的模组已成功应用。

# IssuesInDeployment
source: Potential issues in deployment
fr: Problèmes potentiels dans le déploiement
zh_hans: 可能的部署问题

source: Deployment unsuccessful
fr: Échec du déploiement
zh_hans: 部署失败

# ContinueButton
source: Continue
fr: Continuer
zh_hans: 继续

source: Downloading
fr: Téléchargement en cours
zh_hans: 正在下载

# ModBeingDownloaded
source: The mod is currently being downloaded - please wait.
fr: Le mod est en cours de téléchargement - veuillez patienter.
zh_hans: 该模组正在下载 - 请稍候。

# CouldntDownloadMod
source: Couldn't download the mod! Check your internet connection, or contact the mod author for help.
fr: Impossible de télécharger le mod ! Vérifiez votre connexion internet ou contactez l'auteur du mod pour obtenir de l'aide.
zh_hans: 无法下载模组！请检查您的网络连接，或联系模组作者寻求帮助。

source: Enabled
fr: Activé
zh_hans: 启用

source: Enabled by default
fr: Activé par défaut
zh_hans: 默认启用

source: Disabled by default
fr: Désactivé par défaut
zh_hans: 默认禁用

source: Default value:
fr: Valeur par défaut
zh_hans: 默认值:

source: Value
fr: Valeur
zh_hans: 值

source: Mod name
fr: Nom du mod
zh_hans: 模组名称

# EnterModName
source: Please enter a name for the mod
fr: Veuillez saisir un nom pour le mod
zh_hans: 请输入模组名称

# InvalidModDesc
source: The mod you're trying to install is invalid!
fr: Le mod que vous essayez d'installer n'est pas valide !
zh_hans: 您正在尝试安装的模组无效！

# CouldntUpgradeModDesc
source: The mod you're trying to install is a mod for an older version of the Simple Mod Framework, but it couldn't be automatically upgraded.
fr: Le mod que vous essayez d'installer est un mod pour une ancienne version du Simple Mod Framework, mais il ne peut pas être mis à jour automatiquement.
zh_hans: 您正在尝试安装的模组是旧版本的 Simple Mod Framework 的模组，但它无法自动升级。

# ModAddExtractionInProgress
source: The mod is being extracted and added to the framework. Please wait.
fr: Le mod est en cours d'extraction et d'ajout sur SMF. Veuillez patienter.
zh_hans: 正在提取模组并添加到框架中，请稍候。

# ImproperInstalledModDesc
source: One or more mods have been installed directly into the Mods folder. This is not recommended; the GUI performs checks on mods for validity and security and installing directly to the Mods folder bypasses this. It's easy to break the framework by doing this.
fr: Un ou plusieurs mods ont été installés directement dans le dossier Mods. Ce n'est pas recommandé ; l'interface graphique vérifie la validité et la sécurité des mods et les installer directement dans le dossier Mods contourne les vérifications. Il est facile de briser SMF en faisant cela.
zh_hans: 一个或多个模组已直接安装到模组文件夹中。不推荐这样做：GUI可检查模组的有效性和安全性，直接安装到模组文件夹会绕过此功能。这样做很容易破坏框架。

# ImproperInstalledMod
source: Improperly installed mod
fr: Mod mal installé
zh_hans: 安装模组方式不当

source: Adding mod
fr: Ajout du mod
zh_hans: 添加模组

source: Couldn't upgrade mod
fr: Impossible de mettre à niveau le mod
zh_hans: 无法升级模组

source: Invalid mod
fr: Mod non valide
zh_hans: 无效模组

source: RPKG mod
fr: Mod au format RPKG
zh_hans: RPKG 模组

# RpkgModDesc
source: This mod is in the older RPKG format, which means that it might be incompatible with other mods, or cause issues in newer game versions. It also won't support SMF features like automatic updating. Are you sure you want to add it? There may be a newer version of the mod, or another mod that does the same thing, available.
fr: Ce mod est dans l'ancien format RPKG, ce qui signifie qu'il peut être incompatible avec d'autres mods ou causer des problèmes avec les nouvelles versions de jeu. Il ne supporte pas non plus les fonctionnalités SMF comme la mise à jour automatique. Êtes-vous sûr de vouloir l'ajouter ? Il peut y avoir une version plus récente du mod, ou un autre mod qui fait la même chose, disponible.
zh_hans: 此模组使用了较旧的 RPKG 格式，这意味着它可能与其他模组不兼容，或者在较新的游戏版本中造成问题。它也不支持自动更新等 SMF 功能。 您确定要添加它吗？可能有较新版本的模组，或者功能相同的模组。

# CancelButton
source: Cancel
fr: Annuler
zh_hans: 取消

source: Available Mods
fr: Mods disponibles
zh_hans: 可用模组

# AddModButton
source: Add a Mod
fr: Ajouter un mod
zh_hans: 添加模组

# FindModsButton
source: Find Mods
fr: Trouver des mods
zh_hans: 寻找模组

source: Filter available mods
fr: Filtrer les mods disponibles
zh_hans: 筛选可用模组

# InvalidModButton
source: Invalid Mod
fr: Mod non valide
zh_hans: 无效模组

# InvalidModButtonDesc
source: Use VS Code or GlacierKit to see manifest errors.
fr: Utilisez VS Code ou GlacierKit pour voir les erreurs du manifest.
zh_hans: 使用 VS Code 或 GlacierKit 查看清单错误。

# DeleteButton
source: Delete
fr: Supprimer
zh_hans: 删除

source: Error getting mods
fr: Erreur lors de l'obtention des mods
zh_hans: 获取模组时出错

source: Enabled Mods
fr: Mods activés
zh_hans: 已启用模组

# ApplyModsButton
source: Apply Mods
fr: Appliquer les mods
zh_hans: 应用模组

# ProfilesButton
source: Profiles
fr: Profils
zh_hans: 资料

# DeployAnalyserButton
source: Deploy Analyser
fr: Déployer l'Analyseur
zh_hans: 部署分析程序

source: No game selected
fr: Aucun jeu sélectionné
zh_hans: 未选择游戏

source: Filter enabled mods
fr: Filtrer les mods activés
zh_hans: 筛选已启用模组

# SettingsButton
source: Settings
fr: Paramètres
zh_hans: 设置

# DisableButton
source: Disable
fr: Désactiver
zh_hans: 禁用

# DropHint
source: Drop to install
fr: Déposer pour installer
zh_hans: 拖放以安装

# SaveDebugProfileButton
source: Save Debugging Information
fr: Enregistrer les informations de débogage
zh_hans: 保存调试信息

source: Game install
fr: Installation du jeu
zh_hans: 游戏安装

source: Error updating mod
fr: Erreur lors de la mise à jour du mod
zh_hans: 更新模组时出错

source: Updating mod
fr: Mise à jour du mod
zh_hans: 正在更新模组

# ErrorUpdatingSMF
source: Error updating framework
fr: Erreur lors de la mise à jour de SMF
zh_hans: 更新框架时出错

source: Updating framework
fr: Mise à jour de SMF
zh_hans: 正在更新框架

source: Couldn't update mod
fr: Impossible de mettre à jour le mod
zh_hans: 无法更新模组

source: Deploy Analyser
fr: Déployer l'Analyseur
zh_hans: 部署分析程序

# ParallelOperationsNotice
source: Operations are performed in parallel, so the times below will be much larger than the total.
fr: Les opérations sont effectuées en parallèle, donc les temps ci-dessous seront beaucoup plus grands que le total.
zh_hans: 操作是并行进行的，因此下面的时间将大大超过总额。

# ModExplorerDesc
source: These mods are sorted by popularity - you can check Nexus Mods for more.
fr: Ces mods sont triés par popularité - vous pouvez consulter les mods sur Nexus pour en voir davantage.
zh_hans: 这些模组按受欢迎程度排序 - 您可以检查 Nexus Mod 获取更多模组。

# AddSpecificModButton
source: Add Mod
fr: Ajouter un mod
zh_hans: 添加模组

# NoOptionsForMod
source: This mod has no options.
fr: Ce mod n'a pas d'options.
zh_hans: 此模组没有选项。

source: Language
fr: Langue
zh_hans: 语言

# LibarchiveLicenseNotice
source: This software uses libarchive
fr: Ce logiciel utilise libarchive
zh_hans: 此软件使用 libarchive

# ZstdLicenseNotice
source: This software uses Zstandard compression
fr: Ce logiciel utilise la compression Zstandard
zh_hans: 此软件使用 Zstandard 压缩

source: Profile name
fr: Nom du profil
zh_hans: 配置文件名称

# EnterProfileName
source: Please enter a name for the profile
fr: Veuillez saisir un nom pour le profil
zh_hans: 请输入配置文件名称

source: Profiles
fr: Profils
zh_hans: 配置文件列表

# ProfilesDescription
source: You can save lists of mods, with their settings, as profiles to easily switch between them.
fr: Vous pouvez enregistrer des listes de mods avec leurs paramètres, dans des profils pour basculer facilement entre eux.
zh_hans: 您可以保存带有设置的模组列表作为配置文件，以便在它们之间轻松切换。

source: Current settings
fr: Paramètres actuels
zh_hans: 当前设置

# SaveAsProfileButton
source: Save as Profile
fr: Enregistrer comme profil
zh_hans: 保存为配置文件

# ModExplorerOffline
source: The Mod Explorer is not available offline.
fr: L'Explorateur de mods n'est pas disponible hors ligne.
zh_hans: 模组浏览器离线时不可用。

# NoGamePathReminder
source: No game path selected
fr: Aucun chemin de jeu sélectionné
zh_hans: 未选择游戏路径

# NoGamePathReminderDesc
source: You haven't selected a game path - do that in the Mods page before adding your mods.
fr: Vous n'avez pas sélectionné de chemin de jeu - faites-le dans la page Mods avant d'ajouter vos mods.
zh_hans: 您还没有选择游戏路径 - 在添加您的模组之前在模组页面进行此操作。

# PeacockPluginWarning
source: Mod contains Peacock plugins
fr: Le mod contient un ou plusieurs plugins Peacock
zh_hans: 模组包含 Peacock 插件

# PeacockPluginWarningDesc
source: This mod contains Peacock plugins; if you use the Peacock server emulator after applying this mod, its plugins will be able to run their own code, giving the mod's author complete control over your PC. Make sure you trust whoever developed this mod, and wherever you downloaded it from. Are you sure you want to add this mod?
fr: Ce mod contient des plugins Peacock ; si vous utilisez l'émulateur de serveur Peacock après avoir appliqué ce mod, ses plugins seront en mesure d'exécuter leur propre code, en donnant à l'auteur du mod le contrôle complet sur votre PC. Assurez-vous de faire confiance à ceux qui ont développé ce mod et d'où vous l'avez téléchargé. Êtes-vous sûr de vouloir ajouter ce mod ?
zh_hans: 此模组包含 Peacock 插件；如果您在应用此模组后使用了 Peacock 模拟服务器，它的插件将能够运行自己的代码，让模组的作者完全控制您的 PC。请确保您信任此模组的开发者以及下载来源。您确定要添加这个模组吗？

# Requires
source: Requires {mod}
fr: Nécessite {mod}
zh_hans: 需要 {mod}

# IncompatibleWith
source: Incompatible with {mod}
fr: Incompatible avec {mod}
zh_hans: 与 {mod} 不兼容

# PeacockPluginUpdateWarning
source: Mod's Peacock plugins have changed
fr: Les plugins Peacock du mod ont changé
zh_hans: 模组的 Peacock 插件已更改

# PeacockPluginUpdateWarningDesc
source: The Peacock plugins included with this mod have changed, or new plugins have been introduced. If you use the Peacock server emulator after applying this mod, its plugins will be able to run their own code, giving the mod's author complete control over your PC. Make sure you trust whoever developed this mod, and wherever you originally downloaded it from. Are you sure you want to update this mod?
fr: Les plugins Peacock inclus avec ce mod ont changé, ou de nouveaux plugins ont été introduits. Si vous utilisez l'émulateur de serveur Peacock après avoir appliqué ce mod, ses plugins seront en mesure d'exécuter leur propre code, en donnant à l'auteur du mod le contrôle complet sur votre PC. Assurez-vous de faire confiance à ceux qui ont développé ce mod et d'où vous l'avez téléchargé initialement. Êtes-vous sûr de vouloir mettre à jour ce mod ?
zh_hans: 此模组包含的 Peacock 插件已更改，或新插件已启用。如果您在应用此模组后使用了 Peacock 模拟服务器， 它的插件将能够运行自己的代码，让模组作者完全控制您的 PC。请确保您信任此模组的开发者以及下载来源。您确定要更新这个模组吗？

# EnableOnlineServices
source: Enable SMF analytics and server features
fr: Activer les fonctionnalités d'analyse SMF et de serveur
zh_hans: 启用 SMF 分析和服务器功能

# OnlineServicesDisabled
source: Analytics and server features are disabled
fr: Les fonctionnalités d'analyse et de serveur sont désactivées
zh_hans: 分析和服务器功能已禁用

# OnlineServicesDisabledDesc
source: Analytics, and features powered by them, are currently disabled. Analytics are completely anonymous, and enabling them allows for mod conflict detection, more reliable mod update checking and other useful features.
fr: Les analyses et les fonctionnalités qui les alimentent sont actuellement désactivées. Les analytiques sont complètement anonymes, et leur activation permet de détecter les conflits de mods, de vérifier les mises à jour des mods plus fiables et d'autres fonctionnalités utiles.
zh_hans: 分析及其支持的特性目前已禁用。分析是完全匿名的，使其能够检测模组冲突、更可靠的模组更新检查和其他有用的功能。

# EnableOnlineServicesDesc
source: This feature enables completely anonymous reporting of mod lists and basic settings, which allows for statistics around mod usage and conflict detection. It also makes mod update checking more reliable, avoiding rate-limiting for mods hosted on GitHub. A ping with no other information will still be sent if this is disabled, to allow determining how representative the sample is.
fr: Cette fonctionnalité permet des rapports totalement anonymes des listes de mods et des paramètres de base, ce qui permet des statistiques sur l'utilisation des mods et la détection des conflits. Il rend également la vérification des mises à jour des mods plus fiables, évitant ainsi la limitation des tarifs pour les mods hébergés sur GitHub. Un ping sans autre information sera toujours envoyé si cette option est désactivée, pour permettre de déterminer la représentativité de l'échantillon.
zh_hans: 此功能允许完全匿名报告模组列表和基本设置，允许提供关于模组使用和冲突侦测的统计数据。它还使模组更新检查更加可靠，避免对托管在 GitHub 上的模组进行比率限制。如果禁用，将仍然发送没有其他信息的ping，以确定样品的代表性。

# ObeyDynresDisable
source: Disable dynamic resources when necessary
fr: Désactiver les ressources dynamiques si nécessaire
zh_hans: 必要时禁用动态资源

# ObeyDynresDisableDesc
source: Makes it possible to use certain changes in online mode. You should leave this on unless you have a specific reason not to.
fr: Permet d'utiliser certains changements en mode en ligne. Vous devriez laisser cela actif à moins que vous n'ayez une raison spécifique de ne pas le faire.
zh_hans: 允许在在线模式下使用某些更改。除非您有特定的理由不使用此功能，否则请保持开启。

# ModAddUpgradeInProgress
source: The mod is being upgraded to the latest framework version. Please wait.
fr: Le mod est en cours de mise à jour vers la dernière version de SMF. Veuillez patienter.
zh_hans: 模组正在升级到最新的框架版本。请稍候。

source: Unrecognised game version
fr: Version du jeu non reconnue
zh_hans: 无法识别的游戏版本

# UnrecognisedGameVersionDesc
source: If the game has recently updated, the framework will need to be patched by its developers.
fr: Si le jeu a récemment été mis à jour, SMF devra être corrigé par ses développeurs.
zh_hans: 如果游戏最近更新，框架将需要由开发者修复。

# UnrecognisedGameVersionDesc2
source: If you're using a pirated or cracked version of the game, that's the problem.
fr: Si vous utilisez une version piratée ou craquée du jeu, c'est le problème.
zh_hans: 如果您正在使用盗版或破解的游戏版本，问题就在于此。

# UnrecognisedGameVersionUpdateQuestion
source: Has a game update recently been released?
fr: Une mise à jour du jeu a-t-elle été publiée récemment ?
zh_hans: 最近是否发布过游戏更新？

# UnrecognisedGameVersionUpdatedDesc
source: Wait for the Simple Mod Framework to be updated by its developers. You will see the update when it is released on the Home page. Do not post a comment on Nexus about this.
fr: Attendez que le Simple Mod Framework soit mis à jour par ses développeurs. Vous verrez la mise à jour quand elle sera publiée sur la page d'accueil. Ne publiez pas de commentaire sur Nexus à ce sujet.
zh_hans: 等待开发者更新 Simple Mod Framework。发布后您将在主页看到更新。请不要在 Nexus 上发表此问题的评论。

# UnrecognisedGameVersionNotUpdatedDesc
source: Verify your game files and ensure you are on the latest version of the game, using the Steam, Epic or Microsoft/Xbox app. You can search "how do I verify my game files" on Google for more information.
fr: Vérifiez vos fichiers de jeu et assurez-vous que vous êtes sur la dernière version du jeu, en utilisant l'application Steam, Epic ou Microsoft/Xbox. Vous pouvez rechercher "comment puis-je vérifier mes fichiers de jeu" sur Google pour plus d'informations.
zh_hans: 使用 Steam、Epic 或 Microsoft/Xbox 应用程序验证您的游戏文件并确保您处于最新版本的游戏。 您可以在 Google 搜索“如何验证我的游戏文件”以获取更多信息。

# YesButton
source: Yes
fr: Oui
zh_hans: 是

# NoButton
source: No
fr: Non
zh_hans: 否

# UnrecognisedGameVersionReadReminder
source: READ the following before asking for support with this issue.
fr: LIRE ce qui suit avant de demander de l'aide pour ce problème.
zh_hans: 在请求对此问题的支持之前，请注意阅读以下内容。

# ReadAloudButton
source: Read Aloud
fr: Lecture à voix haute
zh_hans: 大声朗读

# SDKModWarningDesc
source: This mod contains ZHMModSDK mods. When you run the game, its DLLs will be able to run their own code, giving the mod's author complete control over your PC. Make sure you trust whoever developed this mod, and wherever you downloaded it from. Are you sure you want to add this mod?
fr: Ce mod contient des mods ZHMModSDK. Lorsque vous exécutez le jeu, ses DLL seront en mesure d'exécuter leur propre code, ce qui donnera à l'auteur du mod le contrôle total sur votre PC. Assurez-vous de faire confiance à ceux qui ont développé ce mod et d'où vous l'avez téléchargé. Êtes-vous sûr de vouloir ajouter ce mod ?
zh_hans: 此模组包含 ZHMModSDK 模组。 当您运行游戏时，其 DLL 将能够运行自己的代码，让模组作者完全控制您的 PC。 请确保您信任模组开发者以及下载来源。您确定要添加这个模组吗？

# SDKModWarning
source: Mod contains SDK mods
fr: Le mod contient des mods SDK
zh_hans: 模组包含 SDK 模组
